#Область Пример

&НаКлиенте
Процедура Приветствие(Знач Имя) Экспорт
    Если Имя = Неопределено Тогда
        Сообщить("Привет, мир!");
        Возврат;
    КонецЕсли;

    Сообщить("Привет, " + Имя);
КонецПроцедуры

Функция ПолучитьЗапрос() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
        |   Номенклатура.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |   Номенклатура.ПометкаУдаления = ЛОЖЬ";

    Возврат Запрос;
КонецФункции

#КонецОбласти
